In [ ]:
import numpy as np
import pandas as pd

**1\.** Как создать pd.Series из листа, numpy array и словаря(dict)? (★☆☆)

In [ ]:
mylist = list('abcedfghijklmnopqrstuvwxyz')
myarr = np.arange(26)
mydict = dict(zip(mylist, myarr))

#your code
print(pd.Series(mylist))
print(pd.Series(myarr))
print(pd.Series(mydict))

**2\.** Как сделать превратить индексы из датафрейма в колонку? (★☆☆)

In [ ]:
df=pd.DataFrame(['a', 'b', 'c'])

#your code
df.reset_index()

   index  0
0      0  a
1      1  b
2      2  c

**3\.** Как из нескольких pd.Series сделать один датафрейм? (★★☆)

(hint: pd.concat или словарь с колонками)

In [ ]:
df1=pd.Series(['a', 'b', 'c'])
df2=pd.Series(['aa', 'b1', 'c2'])
df3=pd.Series(['44', '55', '66'])

#your code
pd.concat([df1, df2, df3])

0     a
1     b
2     c
0    aa
1    b1
2    c2
0    44
1    55
2    66
dtype: object

**4\.** Как получить строки из series A, которые не содержатся в series B? (★★☆)

In [ ]:
df1=pd.Series(['a', 'b', 'c'])
df2=pd.Series(['a', 'b1', 'c2'])

#your code
df1[~df2.isin(df1)]

1    b
2    c
dtype: object

**5\.** Как получить из series/dataframe минимум, 25й персентиль, медиану, 75тый персентиль, максимум? (★☆☆)

(hint: использовать одну команду)

In [ ]:
df1=pd.Series(np.arange(10, 99))

#your code
df1.describe()

count    89.000000
mean     54.000000
std      25.836021
min      10.000000
25%      32.000000
50%      54.000000
75%      76.000000
max      98.000000
dtype: float64

**6\.** Как получить частоту\долю для всех уникальных объектов в series? (★☆☆)

In [ ]:
df1=pd.Series(['a', 'b', 'c', 'g', 'v', 'a', 'a', 'a', 'u', 'a', 'b', 'c', 'c'])

#your code
df1.value_counts(normalize=True)

a    0.384615
c    0.230769
b    0.153846
v    0.076923
u    0.076923
g    0.076923
dtype: float64

**7\.** Как оставить только топ-2 самых часто встречающихся значений, а все остальные значения заменить на 'other'?  (★★☆)

In [ ]:
df1=pd.Series(['a', 'b', 'c', 'g', 'v', 'a', 'a', 'a', 'u', 'a', 'b', 'c', 'c'])

#your code
df1.where(cond=df1.isin(df1.value_counts().nlargest(2).index),other='other')

0         a
1     other
2         c
3     other
4     other
5         a
6         a
7         a
8     other
9         a
10    other
11        c
12        c
dtype: object

**8\.** Как разбить колонку с числовыми значениями на 10 групп одинакового размера?  (★★☆)

(hint: pd.qcut)

In [ ]:
s = pd.Series(np.random.random(20))

#your code
pd.qcut(s,10)

0                    (0.762, 0.878]
1                    (0.549, 0.568]
2                    (0.762, 0.878]
3     (0.036699999999999997, 0.165]
4                    (0.694, 0.762]
5                    (0.398, 0.549]
6                    (0.694, 0.762]
7                    (0.568, 0.694]
8                    (0.878, 0.993]
9                    (0.338, 0.398]
10    (0.036699999999999997, 0.165]
11                   (0.214, 0.338]
12                   (0.398, 0.549]
13                   (0.165, 0.214]
14                   (0.568, 0.694]
15                   (0.549, 0.568]
16                   (0.214, 0.338]
17                   (0.338, 0.398]
18                   (0.165, 0.214]
19                   (0.878, 0.993]
dtype: category
Categories (10, interval[float64]): [(0.036699999999999997, 0.165] < (0.165, 0.214] < (0.214, 0.338] <
                                     (0.338, 0.398] ... (0.568, 0.694] < (0.694, 0.762] <
                                     (0.762, 0.878] < (0.878, 0.993]]

**9\.** Как найти позиции чисел, которые делятся на 3 без остатка из series?  (★★☆)

(можно с помощью numpy и с помощью pandas)

In [ ]:
s = pd.Series([1,2,3,4,5,6,7,8,9])
s[s.mod(3) == 0].index

Int64Index([2, 5, 8], dtype='int64')

**10\.** Как извлечь из series строки по индексам?  (★☆☆)

In [ ]:
s = pd.Series(list('abcdefghijklmnopqrstuvwxyz'))
pos = [0, 4, 8, 14, 20]

#your code
s.iloc[pos].values

array(['a', 'e', 'i', 'o', 'u'], dtype=object)

**11\.** Как сделать stack двух series вертикально и горизонтально? (★☆☆)

(hint: pd.append, pd.concat)

In [ ]:
s1 = pd.Series(range(5))
s2 = pd.Series(list('abcde'))

#your code
s1.append(s2)
pd.concat([s1,s2],axis=1)

   0  1
0  0  a
1  1  b
2  2  c
3  3  d
4  4  e

**12\.** Как получить позиции строк из series A из другого series B? (★☆☆)

(можно с помощью numpy и с помощью pandas)

In [ ]:
s1 = pd.Series([10, 9, 6, 5, 3, 1, 12, 8, 13])
s2 = pd.Series([1, 3, 10, 13])

#your code
s1.where(s1.isin(s2)).dropna()

0    10.0
4     3.0
5     1.0
8    13.0
dtype: float64

**13\.** Как вычислить среднеквадратическую ошибку для истинных и предсказанных значений? (★★☆)

In [ ]:
truth = pd.Series(range(10))
pred = pd.Series(range(10)) + np.random.random(10)

#your code
((truth-pred)**2).mean()

0.29527313545713624

**14\.** Как конвертировать каждый первый элемент строке в series в верхний регистр? (★★☆)

In [ ]:
s = pd.Series(['how', 'to', 'kick', 'ass?'])

#your code
s.str.capitalize()

0     How
1      To
2    Kick
3    Ass?
dtype: object

**15\.** Как посчитать количество символов в каждой строке? (★★☆)

In [ ]:
s = pd.Series(['how', 'to', 'kick', 'ass?'])

#your code
s.str.len()

0    3
1    2
2    4
3    4
dtype: int64

**16\.** Как преобразовать даты в виде строк в timeseries?  (★☆☆)

(hint: pd.to_datetime)

In [ ]:
s = pd.Series(['01 Jan 2010', '02-02-2011', '20120303', '2013/04/04', '2014-05-05', '2015-06-06T12:20'])

#your code
pd.to_datetime(s)

0   2010-01-01 00:00:00
1   2011-02-02 00:00:00
2   2012-03-03 00:00:00
3   2013-04-04 00:00:00
4   2014-05-05 00:00:00
5   2015-06-06 12:20:00
dtype: datetime64[ns]

**17\.** Как получить день месяца, номер недели, день года и день недели из даты в виде строки? (★★☆)

In [ ]:
s = pd.Series(['01 Jan 2010', '02-02-2011', '20120303', '2013/04/04', '2014-05-05', '2015-06-06T12:20'])

#your code

print("Date: ",   np.array(pd.to_datetime(s).dt.day))

print("Week number: ",    np.array(pd.to_datetime(s).dt.isocalendar().week))

print("Day number of year: ",    np.array(pd.to_datetime(s).dt.dayofyear))

print("Day of week: ",     np.array(pd.to_datetime(s).dt.day_name()))

Date:  [1 2 3 4 5 6]
Week number:  [53 5 9 14 19 23]
Day number of year:  [  1  33  63  94 125 157]
Day of week:  ['Friday' 'Wednesday' 'Saturday' 'Thursday' 'Monday' 'Saturday']

**18\.** Как конвертировать дату из формата месяц-год в формат год-месяц-первое число? (★★☆)

(hint: .strftime('%Y-%m-%d'))

In [ ]:
s = pd.Series(['Jan 2017', 'Feb 2019', 'Mar 2012'])

#your code
pd.to_datetime(s).dt.strftime('%Y-%m-%d')

0    2017-01-01
1    2019-02-01
2    2012-03-01
dtype: object

**19\.** Как отфильтровать слова, содержащие не менее 2 гласных? (★★☆)

In [ ]:
s = pd.Series(['Kitty', 'Cat', 'Plan', 'Python', 'Money'])

#your code
s[s.str.lower().str.count(r'[iyaoe]')>=2]

0     Kitty
3    Python
4     Money
dtype: object

**20\.** Заполните все пропущенные даты от минимальной до максимальной, значения при этом дожны быть равны предыдущей не пропущеной дате (★★★)

In [ ]:
s = pd.Series([1,10,3,np.nan], index=pd.to_datetime(['2000-01-01', '2000-01-03', '2000-01-06', '2000-01-08']))

#your code
ss=pd.Series([np.nan] * len(pd.date_range(s.index.min(),s.index.max())), index=pd.date_range(s.index.min(),s.index.max()))
ss[s.index]=s
ss.fillna(method='ffill')

2000-01-01     1.0
2000-01-02     1.0
2000-01-03    10.0
2000-01-04    10.0
2000-01-05    10.0
2000-01-06     3.0
2000-01-07     3.0
2000-01-08     3.0
Freq: D, dtype: float64

**21\.** Считайте файл из CSV-файла по строчно и добавьте считанные строки в датафрейм (файл data/BostonHousing.csv)?  (★★☆)

(hint: csv reader)

In [ ]:
import csv
with open('BostonHousing.csv','r') as csvfile:
  body=csv.reader(csvfile)
  body=[[*row] for row in body]
df = pd.DataFrame(body).rename(columns=df.iloc[0])
df.head(5).drop(0)

      crim  zn indus chas    nox     rm  ... rad  tax ptratio       b lstat  medv
1  0.00632  18  2.31    0  0.538  6.575  ...   1  296    15.3   396.9  4.98    24
2  0.02731   0  7.07    0  0.469  6.421  ...   2  242    17.8   396.9  9.14  21.6
3  0.02729   0  7.07    0  0.469  7.185  ...   2  242    17.8  392.83  4.03  34.7
4  0.03237   0  2.18    0  0.458  6.998  ...   3  222    18.7  394.63  2.94  33.4

[4 rows x 14 columns]

**22\.** Как изменить значения столбца при импорте csv в фрейм данных?
Импортируйте датасет с помощью pd.read_csv, но колонку 'medv' (median house value) измените так, что если value < 25 = ‘Low’ и если > 25 = ‘High’.  (★★☆)

(hint: pd.read_csv(....., converts={}))

In [ ]:
def medv(string:str):
  return ('Low' if float(string) < 25 else 'High')

df = pd.read_csv('BostonHousing.csv', converters={'medv': medv})
df.head(5)

      crim    zn  indus  chas    nox  ...  tax  ptratio       b  lstat  medv
0  0.00632  18.0   2.31     0  0.538  ...  296     15.3  396.90   4.98   Low
1  0.02731   0.0   7.07     0  0.469  ...  242     17.8  396.90   9.14   Low
2  0.02729   0.0   7.07     0  0.469  ...  242     17.8  392.83   4.03  High
3  0.03237   0.0   2.18     0  0.458  ...  222     18.7  394.63   2.94  High
4  0.06905   0.0   2.18     0  0.458  ...  222     18.7  396.90   5.33  High

[5 rows x 14 columns]

**23\.** Как импортировать только указанные столбцы('crim' и 'medv') и только n строк из CSV-файла?  (★☆☆)

In [ ]:
pd.read_csv('BostonHousing.csv', usecols=['crim','medv'], nrows=5)

      crim  medv
0  0.00632  24.0
1  0.02731  21.6
2  0.02729  34.7
3  0.03237  33.4
4  0.06905  36.2

**24\.** Как получить кол-во строк, кол-во столбцов, тип столбцов, кол-во столбцов с таким типом данных, итоговую статистику каждого столбца датафрейма?  (★☆☆)

In [ ]:
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')

#  number of rows and columns

# datatypes

# how many columns under each dtype

# summary statistics
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 93 entries, 0 to 92
Data columns (total 27 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Manufacturer        89 non-null     object
 1   Model               92 non-null     object
 2   Type                90 non-null     object
 3   Min.Price           86 non-null     float64
 4   Price               91 non-null     float64
 5   Max.Price           88 non-null     float64
 6   MPG.city            84 non-null     float64
 7   MPG.highway         91 non-null     float64
 8   AirBags             87 non-null     object
 9   DriveTrain          86 non-null     object
 10  Cylinders           88 non-null     object
 11  EngineSize          91 non-null     float64
 12  Horsepower          86 non-null     float64
 13  RPM                 90 non-null     float64
 14  Rev.per.mile        87 non-null     float64
 15  Man.trans.avail     88 non-null     object
 16  Fuel.tank.capacity  85 non-null     float64
 17  Passengers          91 non-null     float64
 18  Length              89 non-null     float64
 19  Wheelbase           92 non-null     float64
 20  Width               87 non-null     float64
 21  Turn.circle         88 non-null     float64
 22  Rear.seat.room      89 non-null     float64
 23  Luggage.room        74 non-null     float64
 24  Weight              86 non-null     float64
 25  Origin              88 non-null     object
 26  Make                90 non-null     object
dtypes: float64(18), object(9)
memory usage: 19.7+ KB

**25\.** Как извлечь номер строки и столбца конкретной ячейки с заданным критерием? (★☆☆)

In [ ]:
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')

# Get Manufacturer with highest price
df.loc[df['Price'].idxmax()].Manufacturer
# Get Row and Column number
df.loc[df['Price'].idxmax()].name, df.columns.get_loc('Price')
# Get the value
df.loc[df['Price'].idxmax()].Price

df.loc[df['Price'].idxmax()].name, df.columns.get_loc('Price')

(58, 4)

**26\.** Переименнуйте колонку Type в CarType, в столбцах с '.' в названии замените её на '_'. Как добавить ко всем названиям колонок суффиксы?  (★☆☆)

In [ ]:
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')

#your code
df.rename(columns={'Type': 'CarType'}, inplace=True)
df.rename(columns=lambda s: s.replace('.', '_'), inplace=True)
df.rename(columns=lambda s: s + '_suffix', inplace=True)
df.head(5)

  Manufacturer_suffix Model_suffix  ... Origin_suffix    Make_suffix
0               Acura      Integra  ...       non-USA  Acura Integra
1                 NaN       Legend  ...       non-USA   Acura Legend
2                Audi           90  ...       non-USA        Audi 90
3                Audi          100  ...       non-USA       Audi 100
4                 BMW         535i  ...       non-USA       BMW 535i

[5 rows x 27 columns]

**27\.** Проверьте есть ли в датафрейме пропуски? Если да, посчитайте кол-во nan\none в каждом столбце датафрейма  (★★☆)

In [ ]:
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')

#your code
df.isna().sum()

Manufacturer           4
Model                  1
Type                   3
Min.Price              7
Price                  2
Max.Price              5
MPG.city               9
MPG.highway            2
AirBags                6
DriveTrain             7
Cylinders              5
EngineSize             2
Horsepower             7
RPM                    3
Rev.per.mile           6
Man.trans.avail        5
Fuel.tank.capacity     8
Passengers             2
Length                 4
Wheelbase              1
Width                  6
Turn.circle            5
Rear.seat.room         4
Luggage.room          19
Weight                 7
Origin                 5
Make                   3
dtype: int64

**28\.** Как заменить отсутствующие значения нескольких числовых столбцов средним?  (★★☆)

In [ ]:
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')

#your code
df.fillna(df.mean())

   Manufacturer    Model     Type  ...  Weight   Origin                Make
0         Acura  Integra    Small  ...  2705.0  non-USA       Acura Integra
1           NaN   Legend  Midsize  ...  3560.0  non-USA        Acura Legend
2          Audi       90  Compact  ...  3375.0  non-USA             Audi 90
3          Audi      100  Midsize  ...  3405.0  non-USA            Audi 100
4           BMW     535i  Midsize  ...  3640.0  non-USA            BMW 535i
..          ...      ...      ...  ...     ...      ...                 ...
88   Volkswagen  Eurovan      Van  ...  3960.0      NaN  Volkswagen Eurovan
89   Volkswagen   Passat  Compact  ...  2985.0  non-USA   Volkswagen Passat
90   Volkswagen  Corrado   Sporty  ...  2810.0  non-USA  Volkswagen Corrado
91        Volvo      240  Compact  ...  2985.0  non-USA           Volvo 240
92          NaN      850  Midsize  ...  3245.0  non-USA           Volvo 850

[93 rows x 27 columns]

**29\.** Как выбрать конкретный столбец из датафрейма в качестве датафрейма, а не series?  (★☆☆)

In [ ]:
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')

#your code
df[['Manufacturer']]

   Manufacturer
0         Acura
1           NaN
2          Audi
3          Audi
4           BMW
..          ...
88   Volkswagen
89   Volkswagen
90   Volkswagen
91        Volvo
92          NaN

[93 rows x 1 columns]

**30\.** Как изменить порядок столбцов данных? (☆☆☆)

In [ ]:
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')

#your code
col=df.columns.to_list()
np.random.shuffle(col)
df[col]

    Width  Luggage.room  MPG.highway  ...                Make  Horsepower     RPM
0    68.0           NaN         31.0  ...       Acura Integra       140.0  6300.0
1    71.0          15.0         25.0  ...        Acura Legend       200.0  5500.0
2    67.0          14.0         26.0  ...             Audi 90       172.0  5500.0
3     NaN          17.0         26.0  ...            Audi 100       172.0  5500.0
4    69.0          13.0         30.0  ...            BMW 535i       208.0  5700.0
..    ...           ...          ...  ...                 ...         ...     ...
88   72.0           NaN         21.0  ...  Volkswagen Eurovan       109.0  4500.0
89   67.0          14.0         30.0  ...   Volkswagen Passat       134.0  5800.0
90   66.0          15.0         25.0  ...  Volkswagen Corrado       178.0  5800.0
91   67.0          14.0         28.0  ...           Volvo 240       114.0  5400.0
92   69.0          15.0         28.0  ...           Volvo 850       168.0  6200.0

[93 rows x 27 columns]

**31\.** Как установить количество строк и столбцов, отображаемых в выводе? (☆☆☆)

(hint: pd.set_option)

In [ ]:
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')

#your code
pd.set_option('display.max_rows', 5)
pd.set_option('display.max_columns', 5)
df

   Manufacturer    Model  ...   Origin           Make
0         Acura  Integra  ...  non-USA  Acura Integra
1           NaN   Legend  ...  non-USA   Acura Legend
..          ...      ...  ...      ...            ...
91        Volvo      240  ...  non-USA      Volvo 240
92          NaN      850  ...  non-USA      Volvo 850

[93 rows x 27 columns]

**32\.** Как получить номер строки, в которой содержится максимальное значение в столбце? (★★☆)

In [ ]:
df = pd.DataFrame(np.random.randint(1, 30, 30).reshape(10,-1), columns=list('abc'))

#your code
np.unravel_index(df.to_numpy().argmax(), df.shape)

(7, 1)

**33\.** Как получить последние n строк датафрейма с суммой строк 100?  (★★★)

In [ ]:
df.tail(100)

### Выбросы (оutliers)

* 5 Ways to Detect Outliers/Anomalies That Every Data Scientist Should Know (Python Code)

https://towardsdatascience.com/5-ways-to-detect-outliers-that-every-data-scientist-should-know-python-code-70a54335a623

**34\.** Как найти и заменить выбросы из столбца Series или датафрейма? (★★★)

Замените все значения из столбца ниже 5того и больше 95го персентиля, на пограничные значения.

(hint: .quantile())

In [ ]:
s = pd.Series(np.logspace(-2, 2, 30))

#your code

**35\.** Попробуйте реализовать метод Interquartile Range (IQR) (★★★)

Почитать про него можно по ссылке выше.

In [ ]:
s = pd.Series(np.logspace(-2, 2, 30))

#your code

**36\.** Как поменять местами две строки данных? (★★★)

In [ ]:
df = pd.DataFrame(np.arange(25).reshape(5, -1))

#your code

### one-hot-encoding

**37\.** Как создать однозначные кодировки категориальной переменной? (★★★)

Сделайте one-hot кодировку столбца 'a'.

In [ ]:
df = pd.DataFrame([['aa', 'kek'], ['ba', 'lol'], ['ab', 'kek'], ['aa', 'lol'], ['cc', 'kek']], columns=['a', 'b'])

#your code

**38\.** Нормализуйте все столбцы в датафрейме. (★★★)

a) Нормализовать все столбцы df путем вычитания среднего значения столбца и деления на стандартное отклонение. 

b) Трансформируйте все столбцы df так, чтобы минимальное значение в каждом столбце было 0, а max = 1.

In [ ]:
df = pd.DataFrame(np.random.randint(1,100, 80).reshape(8, -1))

#your code

**39\.** Как получить конкретную группу из датафрейма сгруппированного по ключу? (★★★)

Сгруппируйте по 'name', и выведите данные по группе 'orange'.

(hint: groupby(), get_group())

In [ ]:
df = pd.DataFrame({'name': ['apple', 'banana', 'orange'] * 3,
                   'taste': np.random.rand(9),
                   'price': np.random.randint(0, 15, 9)})

#your code
df.groupby('name').get_group('orange')

     name     taste  price
2  orange  0.151402     12
5  orange  0.680575      0
8  orange  0.481734      1

**40\.** Как вычислить среднее значение по столбцу 'price' по каждому фрукту в датафрейме и сохранить сгруппированный столбец как другой столбец (не индекс)? (★★★)

In [ ]:
df = pd.DataFrame({'name': ['apple', 'banana', 'orange'] * 3,
                   'taste': np.random.rand(9),
                   'price': np.random.randint(0, 15, 9)})

#your code
df.join(df.groupby('name')['price'].mean(), on='name', rsuffix='-mean')

      name     taste  price  price-mean
0    apple  0.467644      5    4.333333
1   banana  0.851300      9    9.333333
..     ...       ...    ...         ...
7   banana  0.208923      9    9.333333
8   orange  0.146667      5    7.666667

[9 rows x 4 columns]

**41\.** Как объединить два датафрейма по двум столбцам, чтобы в них остались только общие строки?  (★★★)

Сделать merge двух датафреймов по колонкам ['fruit', 'weight'] и ['pazham', 'kilo'].

(hint: pd.merge https://pandas.pydata.org/pandas-docs/stable/getting_started/10min.html#merge )

In [ ]:
df1 = pd.DataFrame({'fruit': ['apple', 'banana', 'orange'] * 3,
                    'weight': ['high', 'medium', 'low'] * 3,
                    'price': np.random.randint(0, 15, 9)})

df2 = pd.DataFrame({'pazham': ['apple', 'orange', 'pine'] * 2,
                    'kilo': ['high', 'low'] * 3,
                    'price': np.random.randint(0, 15, 6)})

#your code
pd.merge(df1, df2, left_on=['fruit', 'weight', 'price'], right_on=['pazham', 'kilo', 'price'])

    fruit weight  price  pazham kilo
0  orange    low     10  orange  low

**42\.** Как удалить строки из датафрейма А, которые присутствуют в датафрейме B? (★★★)

In [ ]:
df1 = pd.DataFrame({'fruit': ['apple', 'orange', 'banana'] * 3,
                    'weight': ['high', 'medium', 'low'] * 3,
                    'price': np.arange(9)})

df2 = pd.DataFrame({'fruit': ['apple', 'orange', 'pine'] * 2,
                    'weight': ['high', 'medium'] * 3,
                    'price': np.arange(6)})

#your code
df1[~df1.isin(df2).all(axis=1)]

     fruit  weight  price
2   banana     low      2
3    apple    high      3
..     ...     ...    ...
7   orange  medium      7
8   banana     low      8

[7 rows x 3 columns]

**43\.** Как получить номера строк, в которых совпадают значения двух столбцов? (★★★)

(hint: np.where)

In [ ]:
df = pd.DataFrame({'fruit1': np.random.choice(['apple', 'orange', 'banana'], 10),
                    'fruit2': np.random.choice(['apple', 'orange', 'banana'], 10)})


#your code
df[df['fruit1'] == df['fruit2']]

   fruit1  fruit2
0   apple   apple
6  banana  banana
9  banana  banana

**44\.** Создайте столбец a_shift со сдвигом на одну строку назад. (★★★)

(hint: .shift())

In [ ]:
df = pd.DataFrame(np.random.randint(1, 100, 20).reshape(-1, 4), columns = list('abcd'))

#your code
df['a_shift'] = df['a'].shift(periods=-1)
df

    a   b   c   d  a_shift
0  73  72  71   3     38.0
1  38  94  48  88     86.0
2  86  59  30  19     67.0
3  67  73  76  92     66.0
4  66  50  38  78      NaN

**45\.** Как разбить текстовый столбец на три отдельных столбца? (★★★)

Разбить на три столбцы STD, City, State

In [ ]:
df = pd.DataFrame(["STD, City    State",
"33, Kolkata    West Bengal",
"44, Chennai    Tamil Nadu",
"40, Hyderabad    Telengana",
"80, Bangalore    Karnataka"], columns=['row'])

#your code

### **46\.** Ну а теперь все вместе.  (★★★★★★★★★★)

* Заменяем все точки в названии на '_'
* Выделить категориальные признаки
* Посчитать кол-во уникальных значений во всех текстовых\категориальных столбцах. 
* Колонки с только уникальными значениями удаляем (например Model и Make)
* Для столбцов у которых значений более 10, оставляем топ 10 значений, остальные заменяем на 'other'
* Числовые столбцы проверяем на пропуски. Подсчитываем кол-во nan\none и делим на размер датафрейма -сохраняем в отдельный датафрейм, это доля пропусков в каждом столбце
* Чистим выбросы. Во всех числовых столбцах заменяем все значения столбца меньше 5го персентиля и больше 95ого персентиля на эти пограничные значения.
* Заполняем пропуски в числовых столбцах на среднее по столбцу, в текстовых столбцах на 'other'
* Все категориальные признаки превращаем в one-hot-encoding
* Создать новый столбец Length_Width = Length * Width
* Столбцы MPG_cityми MPG_highway из MPG перевести в единицы LPG (литры \100 км) = (100 * 3,785)  / (MPG * 1,609)
* Посчитать среднюю цену по каждому типу машины у каждого производителя
* Посчитать максимальные Length и Width по Type
* Посчитать кол-во моделей машин по типу машины и наличию подушки безопасности (агрегирование по столбцам Type и AirBags)
* Посчитать кол-во машин по каждому типу машины у каждого производителя(агрегирование по столбцам Type и Manufacturer)
* Посчитать кол-во машин по Manufacturer-Man_trans_avail
* Вывести у какой модели, какого изготовителя максимальная вместимость по пассажирам

In [ ]:
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')

#your code

In [ ]:
df

   Manufacturer    Model     Type  ...  Weight   Origin                Make
0         Acura  Integra    Small  ...  2705.0  non-USA       Acura Integra
1           NaN   Legend  Midsize  ...  3560.0  non-USA        Acura Legend
2          Audi       90  Compact  ...  3375.0  non-USA             Audi 90
3          Audi      100  Midsize  ...  3405.0  non-USA            Audi 100
4           BMW     535i  Midsize  ...  3640.0  non-USA            BMW 535i
..          ...      ...      ...  ...     ...      ...                 ...
88   Volkswagen  Eurovan      Van  ...  3960.0      NaN  Volkswagen Eurovan
89   Volkswagen   Passat  Compact  ...  2985.0  non-USA   Volkswagen Passat
90   Volkswagen  Corrado   Sporty  ...  2810.0  non-USA  Volkswagen Corrado
91        Volvo      240  Compact  ...  2985.0  non-USA           Volvo 240
92          NaN      850  Midsize  ...  3245.0  non-USA           Volvo 850

[93 rows x 27 columns]

In [ ]:
df.columns = df.columns.str.replace('.', '_')

In [ ]:
pd.set_option('display.max_rows', 15)
pd.set_option('display.max_columns', 25)

In [ ]:
category = (df.dtypes == 'float64')
category = category[category].index
df[category]

,Min.Price,Price,Max.Price,MPG.city,MPG.highway,EngineSize,Horsepower,RPM,Rev.per.mile,Fuel.tank.capacity,Passengers,Length,Wheelbase,Width,Turn.circle,Rear.seat.room,Luggage.room,Weight
0,12.9,15.9,18.8,25.0,31.0,1.8,140.0,6300.0,2890.0,13.2,5.0,177.0,102.0,68.0,37.0,26.5,NaN,2705.0
1,29.2,33.9,38.7,18.0,25.0,3.2,200.0,5500.0,2335.0,18.0,5.0,195.0,115.0,71.0,38.0,30.0,15.0,3560.0
2,25.9,29.1,32.3,20.0,26.0,2.8,172.0,5500.0,2280.0,16.9,5.0,180.0,102.0,67.0,37.0,28.0,14.0,3375.0
3,NaN,37.7,44.6,19.0,26.0,NaN,172.0,5500.0,2535.0,21.1,6.0,193.0,106.0,NaN,37.0,31.0,17.0,3405.0
4,NaN,30.0,NaN,22.0,30.0,3.5,208.0,5700.0,2545.0,21.1,4.0,186.0,109.0,69.0,39.0,27.0,13.0,3640.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
88,16.6,19.7,22.7,17.0,21.0,2.5,109.0,4500.0,2915.0,21.1,7.0,187.0,115.0,72.0,38.0,34.0,NaN,3960.0
89,17.6,20.0,22.4,21.0,30.0,2.0,134.0,5800.0,2685.0,18.5,5.0,180.0,103.0,67.0,35.0,31.5,14.0,2985.0
90,22.9,23.3,23.7,18.0,25.0,2.8,178.0,5800.0,2385.0,18.5,4.0,159.0,97.0,66.0,36.0,26.0,15.0,2810.0
91,21.8,22.7,23.5,21.0,28.0,2.3,114.0,5400.0,2215.0,15.8,5.0,190.0,104.0,67.0,37.0,29.5,14.0,2985.0
92,24.8,26.7,28.5,20.0,28.0,2.4,168.0,6200.0,NaN,19.3,5.0,184.0,105.0,69.0,38.0,30.0,15.0,3245.0

In [ ]:
df[category].nunique()

Min.Price         72
Price             80
Max.Price         76
MPG.city          21
MPG.highway       22
                  ..
Width             16
Turn.circle       14
Rear.seat.room    24
Luggage.room      16
Weight            75
Length: 18, dtype: int64

In [ ]:
df['Length_Width'] = df['Length'] * df['Width']
df

,Manufacturer,Type,Min.Price,Price,Max.Price,MPG.city,MPG.highway,AirBags,DriveTrain,Cylinders,EngineSize,Horsepower,...,Man.trans.avail,Fuel.tank.capacity,Passengers,Length,Wheelbase,Width,Turn.circle,Rear.seat.room,Luggage.room,Weight,Origin,Length_Width
0,Acura,Small,12.9,15.9,18.8,25.0,31.0,None,Front,4,1.8,140.0,...,Yes,13.2,5.0,177.0,102.0,68.0,37.0,26.5,NaN,2705.0,non-USA,12036.0
1,NaN,Midsize,29.2,33.9,38.7,18.0,25.0,Driver & Passenger,Front,6,3.2,200.0,...,Yes,18.0,5.0,195.0,115.0,71.0,38.0,30.0,15.0,3560.0,non-USA,13845.0
2,Audi,Compact,25.9,29.1,32.3,20.0,26.0,Driver only,Front,6,2.8,172.0,...,Yes,16.9,5.0,180.0,102.0,67.0,37.0,28.0,14.0,3375.0,non-USA,12060.0
3,Audi,Midsize,NaN,37.7,44.6,19.0,26.0,Driver & Passenger,NaN,6,NaN,172.0,...,NaN,21.1,6.0,193.0,106.0,NaN,37.0,31.0,17.0,3405.0,non-USA,NaN
4,BMW,Midsize,NaN,30.0,NaN,22.0,30.0,NaN,Rear,4,3.5,208.0,...,Yes,21.1,4.0,186.0,109.0,69.0,39.0,27.0,13.0,3640.0,non-USA,12834.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
88,Volkswagen,Van,16.6,19.7,22.7,17.0,21.0,None,Front,5,2.5,109.0,...,Yes,21.1,7.0,187.0,115.0,72.0,38.0,34.0,NaN,3960.0,NaN,13464.0
89,Volkswagen,Compact,17.6,20.0,22.4,21.0,30.0,None,Front,4,2.0,134.0,...,Yes,18.5,5.0,180.0,103.0,67.0,35.0,31.5,14.0,2985.0,non-USA,12060.0
90,Volkswagen,Sporty,22.9,23.3,23.7,18.0,25.0,None,Front,6,2.8,178.0,...,Yes,18.5,4.0,159.0,97.0,66.0,36.0,26.0,15.0,2810.0,non-USA,10494.0
91,Volvo,Compact,21.8,22.7,23.5,21.0,28.0,Driver only,Rear,NaN,2.3,114.0,...,Yes,15.8,5.0,190.0,104.0,67.0,37.0,29.5,14.0,2985.0,non-USA,12730.0
92,NaN,Midsize,24.8,26.7,28.5,20.0,28.0,Driver & Passenger,Front,5,2.4,168.0,...,Yes,19.3,5.0,184.0,105.0,69.0,38.0,30.0,15.0,3245.0,non-USA,12696.0

In [ ]:
more10 = df[category].nunique().ge(10)
df[category[more10]] = df[category[more10]].replace(df[category[more10]].value_counts()[10:].index, 'other')
df

,Manufacturer,Type,Min.Price,Price,Max.Price,MPG.city,MPG.highway,AirBags,DriveTrain,Cylinders,EngineSize,Horsepower,...,Man.trans.avail,Fuel.tank.capacity,Passengers,Length,Wheelbase,Width,Turn.circle,Rear.seat.room,Luggage.room,Weight,Origin,Length_Width
0,Acura,Small,12.9,15.9,18.8,25.0,31.0,None,Front,4,1.8,140.0,...,Yes,13.2,5.0,177.0,102.0,68.0,37.0,26.5,NaN,2705.0,non-USA,12036.0
1,NaN,Midsize,29.2,33.9,38.7,18.0,25.0,Driver & Passenger,Front,6,3.2,200.0,...,Yes,18.0,5.0,195.0,115.0,71.0,38.0,30.0,15.0,3560.0,non-USA,13845.0
2,Audi,Compact,25.9,29.1,32.3,20.0,26.0,Driver only,Front,6,2.8,172.0,...,Yes,16.9,5.0,180.0,102.0,67.0,37.0,28.0,14.0,3375.0,non-USA,12060.0
3,Audi,Midsize,NaN,37.7,44.6,19.0,26.0,Driver & Passenger,NaN,6,NaN,172.0,...,NaN,21.1,6.0,193.0,106.0,NaN,37.0,31.0,17.0,3405.0,non-USA,NaN
4,BMW,Midsize,NaN,30.0,NaN,22.0,30.0,NaN,Rear,4,3.5,208.0,...,Yes,21.1,4.0,186.0,109.0,69.0,39.0,27.0,13.0,3640.0,non-USA,12834.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
88,Volkswagen,Van,16.6,19.7,22.7,17.0,21.0,None,Front,5,2.5,109.0,...,Yes,21.1,7.0,187.0,115.0,72.0,38.0,34.0,NaN,3960.0,NaN,13464.0
89,Volkswagen,Compact,17.6,20.0,22.4,21.0,30.0,None,Front,4,2.0,134.0,...,Yes,18.5,5.0,180.0,103.0,67.0,35.0,31.5,14.0,2985.0,non-USA,12060.0
90,Volkswagen,Sporty,22.9,23.3,23.7,18.0,25.0,None,Front,6,2.8,178.0,...,Yes,18.5,4.0,159.0,97.0,66.0,36.0,26.0,15.0,2810.0,non-USA,10494.0
91,Volvo,Compact,21.8,22.7,23.5,21.0,28.0,Driver only,Rear,NaN,2.3,114.0,...,Yes,15.8,5.0,190.0,104.0,67.0,37.0,29.5,14.0,2985.0,non-USA,12730.0
92,NaN,Midsize,24.8,26.7,28.5,20.0,28.0,Driver & Passenger,Front,5,2.4,168.0,...,Yes,19.3,5.0,184.0,105.0,69.0,38.0,30.0,15.0,3245.0,non-USA,12696.0

In [ ]:
s = pd.DataFrame(df[df.select_dtypes(include='number').columns].isna().sum() / len(df), columns=['NaN/none'])
s

              NaN/none
Min.Price     0.075269
Price         0.021505
...                ...
Luggage.room  0.204301
Weight        0.075269

[18 rows x 1 columns]

In [ ]:
df['Length_Width'] = df['Length'] * df['Width']
df

   Manufacturer    Model  ...           Make  Length_Width
0         Acura  Integra  ...  Acura Integra       12036.0
1           NaN   Legend  ...   Acura Legend       13845.0
..          ...      ...  ...            ...           ...
91        Volvo      240  ...      Volvo 240       12730.0
92          NaN      850  ...      Volvo 850       12696.0

[93 rows x 28 columns]

In [ ]:
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')
df.groupby(['Manufacturer', 'Type']).mean()['Price']

Manufacturer  Type
Acura         Small      15.90
Audi          Compact    29.10
              Midsize    37.70
BMW           Midsize    30.00
Buick         Large      22.25
                         ...
Volkswagen    Compact    20.00
              Small       9.10
              Sporty     23.30
              Van        19.70
Volvo         Compact    22.70
Name: Price, Length: 75, dtype: float64

In [ ]:
df.groupby(['Type'])[['Length', 'Width']].max()

         Length  Width
Type
Compact   190.0   69.0
Large     219.0   78.0
Midsize   205.0   74.0
Small     177.0   68.0
Sporty    193.0   74.0
Van       194.0   78.0

In [ ]:
df.groupby(['Type', 'AirBags'])[['Model']].count()

                            Model
Type    AirBags
Compact Driver & Passenger      2
        Driver only             8
        None                    4
Large   Driver & Passenger      4
        Driver only             7
Midsize Driver & Passenger      7
        Driver only             9
        None                    4
Small   Driver only             5
        None                   14
Sporty  Driver & Passenger      2
        Driver only             6
        None                    2
Van     Driver only             3
        None                    6

In [ ]:
df.groupby(['Type', 'Manufacturer'])[['Model']].count()

                      Model
Type    Manufacturer
Compact Audi              1
        Chevrolet         2
        Chrysler          1
        Dodge             1
        Ford              1
...                     ...
Van     Mazda             1
        Nissan            1
        Oldsmobile        1
        Toyota            1
        Volkswagen        1

[75 rows x 1 columns]

In [ ]:
df.groupby(['Man.trans.avail', 'Manufacturer'])[['Model']].count()

                              Model
Man.trans.avail Manufacturer
No              Buick             4
                Cadillac          2
                Chevrolet         4
                Chrysler          2
                Dodge             2
...                             ...
Yes             Subaru            3
                Suzuki            1
                Toyota            3
                Volkswagen        4
                Volvo             1

[41 rows x 1 columns]

In [ ]:
df[['Manufacturer', 'Model']][df['Passengers'] == df['Passengers'].max()]

   Manufacturer  Model
16    Chevrolet  Astro

**47\.** Перевести индексы первого и третьего уровня в колонки

In [ ]:
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_of_birth': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'weight': [35, 32, 33, 30, 31, 32],
    't_id': ['t1', 't2', 't3', 't4', 't5', 't6']})
df1 = df.set_index(['t_id', 'school_code', 'class'])
df1.reset_index()

  t_id school_code class            name date_of_birth  weight
0   t1        s001     V  Alberto Franco    15/05/2002      35
1   t2        s002     V    Gino Mcneill    17/05/2002      32
2   t3        s003    VI     Ryan Parkes    16/02/1999      33
3   t4        s001    VI    Eesha Hinton    25/09/1998      30
4   t5        s002     V    Gino Mcneill    11/05/2002      31
5   t6        s004    VI    David Parkes    15/09/1997      32

**48\.** Вывести строку из Series и DataFrame по заданному индексу

In [ ]:
ds = pd.Series([1,3,5,7,9,11,13,15], index=[0,1,2,3,4,5,7,8])
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_of_birth': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'weight': [35, 32, 33, 30, 31, 32]})

indx = 4
ds.iloc[indx], df.iloc[indx]

(9, school_code              s002
 class                       V
 name             Gino Mcneill
 date_of_birth      11/05/2002
 weight                     31
 Name: 4, dtype: object)

**49\.** Найти индексы строк с пропущенными данными

In [ ]:
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_of_birth': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'weight': [35, None, 33, 30, 31, None]},
     index = ['t1', 't2', 't3', 't4', 't5', 't6'])
df[df.isna().any(1)].index

Index(['t2', 't6'], dtype='object')

**50\.** Сделать left join датафреймов

In [ ]:
data1 = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                     'P': ['P0', 'P1', 'P2', 'P3'],
                     'Q': ['Q0', 'Q1', 'Q2', 'Q3']}) 
data2 = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                      'key2': ['K0', 'K0', 'K0', 'K0'],
                      'R': ['R0', 'R1', 'R2', 'R3'],
                      'S': ['S0', 'S1', 'S2', 'S3']})
data1.join(data2, how='left', lsuffix='_sfx')

  key1_sfx key2_sfx   P   Q key1 key2   R   S
0       K0       K0  P0  Q0   K0   K0  R0  S0
1       K0       K1  P1  Q1   K1   K0  R1  S1
2       K1       K0  P2  Q2   K1   K0  R2  S2
3       K2       K1  P3  Q3   K2   K0  R3  S3

**51\.** Соединить два датафрейма

In [ ]:
data1 = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                      'B': ['B0', 'B1', 'B2']},
                     index=['K0', 'K1', 'K2'])

data2 = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                      'D': ['D0', 'D2', 'D3']},
                     index=['K0', 'K2', 'K3'])
pd.concat([data1, data2], axis=1)

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

**52\.** Сгруппировать датафрейм по полям 'customer_id' и 'salesman_id' и отсортировать по sum of purch_amt внутри каждой группы

In [ ]:
df = pd.DataFrame({
'ord_no':[70001,70009,70002,70004,70007,70005,70008,70010,70003,70012,70011,70013],
'purch_amt':[150.5,270.65,65.26,110.5,948.5,2400.6,5760,1983.43,2480.4,250.45, 75.29,3045.6],
'ord_date': ['2012-10-05','2012-09-10','2012-10-05','2012-08-17','2012-09-10','2012-07-27','2012-09-10','2012-10-10','2012-10-10','2012-06-27','2012-08-17','2012-04-25'],
'customer_id':[3001,3001,3005,3001,3005,3001,3005,3001,3005,3001,3005,3005],
'salesman_id': [5002,5005,5001,5003,5002,5001,5001,5006,5003,5002,5007,5001]})
df.groupby(['customer_id', 'salesman_id'])['purch_amt'].sum().sort_values()

customer_id  salesman_id
3005         5007             75.29
3001         5003            110.50
             5005            270.65
             5002            400.95
3005         5002            948.50
3001         5006           1983.43
             5001           2400.60
3005         5003           2480.40
             5001           8870.86
Name: purch_amt, dtype: float64

**53\.** Сгруппировать датафрейм по месяцу и году из даты ord_date и найти общее количество заказов по годам и по месяцам

In [ ]:
df = pd.DataFrame({
'ord_no':[70001,70009,70002,70004,70007,70005,70008,70010,70003,70012,70011,70013],
'purch_amt':[150.5,270.65,65.26,110.5,948.5,2400.6,5760,1983.43,2480.4,250.45, 75.29,3045.6],
'ord_date': ['05-10-2012','09-10-2012','05-10-2013','08-17-2013','10-09-2013','07-27-2014','10-09-2012','10-10-2012','10-10-2012','06-17-2014','07-08-2012','04-25-2012'],
'customer_id':[3001,3001,3005,3001,3005,3001,3005,3001,3005,3001,3005,3005],
'salesman_id': [5002,5005,5001,5003,5002,5001,5001,5006,5003,5002,5007,5001]})

# Regular expressions with Pandas

**1\.** Выделить в отдельную колонку event_id первую цифру в кавычках, во вторую колонку event_probability вероятность (★☆☆)

In [ ]:
df=pd.DataFrame({'col1':["{'34': 0.9839372122311848}",
                         "{'77': 0.6724645988404411}",
                         "{'77': 0.6491011266207006}",
                         "{'77': 0.6123085784265466}",
                         "{'34': 0.87}",
                         "{'77': 0.6225699652019304}",
                         "{'3': 0.5470808226524633}",
                         "{'77': 0.6233849004135044}",
                         "{'77': 0.7050888998743866}",
                         "{'52': 0.8945052223205372}"]})

#your code
df['event_id']=df['col1'].str.extract(r'((?<=\')\d)')
df['event_probability']=df['col1'].str.extract(r'((?<=: )[\d|.]*)')
df

                          col1 event_id   event_probability
0   {'34': 0.9839372122311848}        3  0.9839372122311848
1   {'77': 0.6724645988404411}        7  0.6724645988404411
..                         ...      ...                 ...
8   {'77': 0.7050888998743866}        7  0.7050888998743866
9   {'52': 0.8945052223205372}        5  0.8945052223205372

[10 rows x 3 columns]

**2\.** Удалите все тэги, переносы строк из текстов новостей (★★★)

(hint: df.column.str())

In [ ]:
df = pd.read_excel('news.xlsx')

#your code
df.text = df.text.str.replace(r'<.*>|\n','')
df

                                                 text
0         Сообщение о существенном факте         о...
1             НИЖНИЙ      НОВГОРОД, 3 декабря 2019...
..                                                ...
18            Samsung Heavy Industries      постав...
19        В администрации Краснодарского края подв...

[20 rows x 1 columns]

**3\.** Проставьте флаг в колонку source_ria если текст новости содержит: риа новости, тасс, коммерсант. Перед поиском переведите тексты в lower и удалите все кроме букв. Данные после чистки из предыдушего задания (★★★)

(hint: df.column.str())

In [ ]:
df['source_ria'] = df['text'].str.lower().str.match(r'.*(риа новости|тасс|коммерсант).*')
df

                                                 text  source_ria
0         Сообщение о существенном факте         о...       False
1             НИЖНИЙ      НОВГОРОД, 3 декабря 2019...       False
..                                                ...         ...
18            Samsung Heavy Industries      постав...        True
19        В администрации Краснодарского края подв...       False

[20 rows x 2 columns]

**4\.** Отфильтруйте строки с валидными емейлами (★★★)

In [ ]:
emails = pd.Series(['buying books at amazom.com', 'rameses@egypt.com', 'matt@t.co', 'narendra@modi.com', 'kek lol@mail.ru'])

#your code

**5\.** Напишите паттерн для поиска строки содержащей только буквы в верхнем и нижнем регистре, цифры и подчеркивание

In [ ]:
import re
pattern = r"^[\w|\d|_]*$"

**6\.** Замените пробелы на подчеркивание и наоборот

In [ ]:
replace(r'_', ' ')
replace(r' ', '_')

**7\.** Найдите слова длиной 3,4,5

In [ ]:
re.findall(r'\b\w{3,5}\b',sz)

**8\.** Сделайте регистронезависимую замену(replace) во входной строке

In [ ]:
import re
from_ = 'baby'
to=re.compile(f'{from_}', re.IGNORECASE)
to.sub('wanna sleep','Imma pretty babY')

'Imma pretty wanna sleep'